; domain
(define (domain fo-counters-rnd)
    (:requirements :strips :typing :equality :adl :fluents)
    (:types counter)
  (:predicates
    (nop ?x - counter)
  )

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )
)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_3_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 - counter
	)
  (:init
		(= (value c0) 64)
	(= (value c1) 19)
	(= (value c2) 77)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
		)
	)
)

; plan
1. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 1 of 2
2. (increment c1)
   changed: (value c1) from 19 to 20
   goals met: 1 of 2
3. (increment c1)
   changed: (value c1) from 20 to 21
   goals met: 1 of 2
4. (increment c1)
   changed: (value c1) from 21 to 22
   goals met: 1 of 2
5. (increment c1)
   changed: (value c1) from 22 to 23
   goals met: 1 of 2
6. (increment c1)
   changed: (value c1) from 23 to 24
   goals met: 1 of 2
7. (increment c1)
   changed: (value c1) from 24 to 25
   goals met: 1 of 2
8. (increment c1)
   changed: (value c1) from 25 to 26
   goals met: 1 of 2
9. (increment c1)
   changed: (value c1) from 26 to 27
   goals met: 1 of 2
10. (increment c1)
   changed: (value c1) from 27 to 28
   goals met: 1 of 2
11. (increment c1)
   changed: (value c1) from 28 to 29
   goals met: 1 of 2
12. (increment c1)
   changed: (value c1) from 29 to 30
   goals met: 1 of 2
13. (increment c1)
   changed: (value c1) from 30 to 31
   goals met: 1 of 2
14. (increment c1)
   changed: (value c1) from 31 to 32
   goals met: 1 of 2
15. (increment c1)
   changed: (value c1) from 32 to 33
   goals met: 1 of 2
16. (increment c1)
   changed: (value c1) from 33 to 34
   goals met: 1 of 2
17. (increment c1)
   changed: (value c1) from 34 to 35
   goals met: 1 of 2
18. (increment c1)
   changed: (value c1) from 35 to 36
   goals met: 1 of 2
19. (increment c1)
   changed: (value c1) from 36 to 37
   goals met: 1 of 2
20. (increment c1)
   changed: (value c1) from 37 to 38
   goals met: 1 of 2
21. (increment c1)
   changed: (value c1) from 38 to 39
   goals met: 1 of 2
22. (increment c1)
   changed: (value c1) from 39 to 40
   goals met: 1 of 2
23. (increment c1)
   changed: (value c1) from 40 to 41
   goals met: 1 of 2
24. (increment c1)
   changed: (value c1) from 41 to 42
   goals met: 1 of 2
25. (increment c1)
   changed: (value c1) from 42 to 43
   goals met: 1 of 2
26. (increment c1)
   changed: (value c1) from 43 to 44
   goals met: 1 of 2
27. (increment c1)
   changed: (value c1) from 44 to 45
   goals met: 1 of 2
28. (increment c1)
   changed: (value c1) from 45 to 46
   goals met: 1 of 2
29. (increment c1)
   changed: (value c1) from 46 to 47
   goals met: 1 of 2
30. (increment c1)
   changed: (value c1) from 47 to 48
   goals met: 1 of 2
31. (increment c1)
   changed: (value c1) from 48 to 49
   goals met: 1 of 2
32. (increment c1)
   changed: (value c1) from 49 to 50
   goals met: 1 of 2
33. (increment c1)
   changed: (value c1) from 50 to 51
   goals met: 1 of 2
34. (increment c1)
   changed: (value c1) from 51 to 52
   goals met: 1 of 2
35. (increment c1)
   changed: (value c1) from 52 to 53
   goals met: 1 of 2
36. (increment c1)
   changed: (value c1) from 53 to 54
   goals met: 1 of 2
37. (increment c1)
   changed: (value c1) from 54 to 55
   goals met: 1 of 2
38. (increment c1)
   changed: (value c1) from 55 to 56
   goals met: 1 of 2
39. (increment c1)
   changed: (value c1) from 56 to 57
   goals met: 1 of 2
40. (increment c1)
   changed: (value c1) from 57 to 58
   goals met: 1 of 2
41. (increment c1)
   changed: (value c1) from 58 to 59
   goals met: 1 of 2
42. (increment c1)
   changed: (value c1) from 59 to 60
   goals met: 1 of 2
43. (increment c1)
   changed: (value c1) from 60 to 61
   goals met: 1 of 2
44. (increment c1)
   changed: (value c1) from 61 to 62
   goals met: 1 of 2
45. (increment c1)
   changed: (value c1) from 62 to 63
   goals met: 1 of 2
46. (increment c1)
   changed: (value c1) from 63 to 64
   goals met: 1 of 2
47. (increment c1)
   changed: (value c1) from 64 to 65
   goals met: 2 of 2
